# GetCircuitNamingSchemeType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalEquipment..::..GetCircuitNamingSchemeType Method
ElectricalEquipment Class See Also
---
Gets enumerated type of the circuit naming scheme used with Electrical Equipment.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public CircuitNaming GetCircuitNamingSchemeType()
```

Visual Basic
---
```text
Public Function GetCircuitNamingSchemeType As CircuitNaming
```

Visual C++
---
```text
public:
CircuitNaming GetCircuitNamingSchemeType()
```

# ### Return Value
The enumerated type of circuit naming scheme.
# See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace